import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-main',
  templateUrl: './main.component.html',
  styleUrls: ['./main.component.css']
})
export class MainComponent implements OnInit {

  count: number[] = [1,2,3,4,5,6,7,8,9,10,11,12];

  jobSearchTypes: string[] = ['Αναζητώ Εργασία', 'Αναζητώ Εργαζόμενο'];
  jobTypesList: string[] = ['Νοσηλευτής', 'Καθαρισμός χώρου', 'Ιατρός', 'Υδραυλικός', 'Φύλαξη ηλικιωμένων', 'Εστίαση', 'Πληροφορική'];
  workingPlaces: string[] = ['Αθήνα',
    'Θεσσαλονίκη',
    'Πάτρα',
    'Ηράκλειο',
    'Λάρισα',
    'Βόλος',
    'Ιωάννινα',
    'Τρίκαλα',
    'Χαλκίδα',
    'Σέρρες',
    'Αλεξανδρούπολη',
    'Ξάνθη',
    'Κατερίνη',
    'Αγρίνιο',
    'Καλαμάτα',
    'Καβάλα',
    'Χανιά',
    'Λαμία',
    'Κομοτηνή',
    'Ρόδος',
    'Δράμα',
    'Βέροια',
    'Κοζάνη',
    'Καρδίτσα',
    'Ρέθυμνο',
    'Πτολεμαΐδα',
    'Τρίπολη',
    'Κόρινθος',
    'Γέρακας',
    'Γιαννιτσά',
    'Μυτιλήνη',
    'Χίος',
    'Σαλαμίνα',
    'Ελευσίνα',
    'Κέρκυρα',
    'Πύργος',
    'Μέγαρα',
    'Κιλκίς',
    'Θήβα',
    'Άργος',
    'Άρτα',
    'Άρτεμη (Λούτσα)',
    'Λιβαδειά',
    'Ωραιόκαστρο',
    'Αίγιο',
    'Κως',
    'Κορωπί',
    'Πρέβεζα',
    'Σπάρτη',
    'Νάουσα',
    'Ορεστιάδα',
    'Περαία',
    'Έδεσσα',
    'Φλώρινα',
    'Αμαλιάδα',
    'Παλλήνη',
    'Θέρμη',
    'Βάρη',
    'Νέα Μάκρη',
    'Αλεξάνδρεια',
    'Παιανία',
    'Καλύβια Θορικού',
    'Ναύπλιο',
    'Ναύπακτος',
    'Καστοριά',
    'Γρεβενά',
    'Μεσολόγγι',
    'Γάζι',
    'Ιεράπετρα',
    'Κάλυμνος (Πόθια)',
    'Ραφήνα',
    'Λουτράκι',
    'Άγιος Νικόλαος',
    'Ερμούπολη',
    'Ιαλυσός',
    'Μάνδρα',
    'Τύρναβος',
    'Γλυκά Νερά'
    ];

  constructor() { }

  ngOnInit(): void {
  }

  
}
